# Reference Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
Reference Class
Members See Also
---
A stable reference to a geometric object in a Revit model.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class Reference : APIObject
```

Visual Basic
---
```text
Public Class Reference _
	Inherits APIObject
```

Visual C++
---
```text
public ref class Reference : public APIObject
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..Reference
# See Also
Reference Members
Autodesk.Revit.DB Namespace